axf33480/ESP32CommandStation/main/stateflows/StatusDisplay.cpp
// OLED memory addressing control
static constexpr uint8_t OLED_MEMORY_MODE              = 0x20;
static constexpr uint8_t OLED_MEMORY_MODE_HORIZONTAL   = 0x00;
static constexpr uint8_t OLED_MEMORY_MODE_VERTICAL     = 0x01;
static constexpr uint8_t OLED_MEMORY_MODE_PAGE         = 0x02;
static constexpr uint8_t OLED_MEMORY_COLUMN_RANGE      = 0x21;
static constexpr uint8_t OLED_MEMORY_PAGE_RANGE        = 0x22;
static constexpr uint8_t OLED_SET_PAGE                 = 0xB0;

// OLED Timing/Driving control
static constexpr uint8_t OLED_CLOCK_DIVIDER            = 0xD5;
static constexpr uint8_t OLED_SET_CHARGEPUMP           = 0x8D;
static constexpr uint8_t OLED_CHARGEPUMP_ON            = 0x14;
static constexpr uint8_t OLED_SET_PRECHARGE            = 0xD9;
static constexpr uint8_t OLED_SET_VCOMH                = 0xDB;

// OLED scroll control
static constexpr uint8_t OLED_DISABLE_SCROLL           = 0x2E;

#elif CONFIG_DISPLAY_TYPE_LCD

// LCD control commands
static constexpr uint8_t LCD_DISPLAY_SHIFT             = 0x10;
static constexpr uint8_t LCD_FUNCTION_SET              = 0x20;
static constexpr uint8_t LCD_ADDRESS_SET               = 0x80;

// LCD shift flags
static constexpr uint8_t LCD_SHIFT_LEFT                = 0x08;
static constexpr uint8_t LCD_SHIFT_RIGHT               = 0x0C;

// LCD commands
static constexpr uint8_t LCD_CMD_CLEAR_SCREEN          = 0x01;
static constexpr uint8_t LCD_CMD_RETURN_HOME           = 0x02;
static constexpr uint8_t LCD_CMD_ENTRY_MODE            = 0x04;
static constexpr uint8_t LCD_CMD_DISPLAY_CONTROL       = 0x08;

static constexpr uint8_t LCD_ENTRY_AUTO_SCROLL         = 0x01;
static constexpr uint8_t LCD_ENTRY_LEFT_TO_RIGHT       = 0x02;

// display control flags
static constexpr uint8_t LCD_CURSOR_BLINK_ON           = 0x01;
static constexpr uint8_t LCD_CURSOR_ON                 = 0x02;
static constexpr uint8_t LCD_DISPLAY_ON                = 0x04;

static constexpr uint8_t LCD_8BIT_MODE                 = 0x10;
static constexpr uint8_t LCD_4BIT_MODE                 = 0x00;
static constexpr uint8_t LCD_TWO_LINE_MODE             = 0x08;
static constexpr uint8_t LCD_ONE_LINE_MODE             = 0x00;

static inline bool send_to_lcd(uint8_t addr, uint8_t value)
{
  i2c_cmd_handle_t cmd = i2c_cmd_link_create();
  i2c_master_start(cmd);
  i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_WRITE, true);
  i2c_master_write_byte(cmd, value, true);
  i2c_master_stop(cmd);
  esp_err_t ret =
    ESP_ERROR_CHECK_WITHOUT_ABORT(i2c_master_cmd_begin(I2C_NUM_0, cmd
                                                     , DISPLAY_I2C_TIMEOUT));
  i2c_cmd_link_delete(cmd);
  if (ret != ESP_OK)
  {
    return false;
  }
  return true;
}

static inline bool send_lcd_nibble(uint8_t addr, uint8_t value, bool data)
{
  uint8_t nibble = (value << 4);
  
  // always send the data with the backlight flag enabled
  nibble |= CONFIG_DISPLAY_LCD_BACKLIGHT_BITMASK;

  // if this is a data byte set the register select flag
  if (data)
  {
    nibble |= CONFIG_DISPLAY_LCD_REGISTER_SELECT_BITMASK;
  }

  // send with ENABLE flag set
  if(!send_to_lcd(addr, nibble | CONFIG_DISPLAY_LCD_ENABLE_BITMASK))
  {
    return false;
  }

  ets_delay_us(1);
  // send without the ENABLE flag set
  if(!send_to_lcd(addr, nibble & ~CONFIG_DISPLAY_LCD_ENABLE_BITMASK))
  {
    return false;
  }
  ets_delay_us(37);
  return true;
}

static inline bool send_lcd_byte(uint8_t addr, uint8_t value, bool data)
{
  return send_lcd_nibble(addr, (value >> 4) & 0x0F, data) &&
         send_lcd_nibble(addr, value & 0x0F, data);
}

#endif

#define I2C_READ_REG(address, reg, data, data_size, status)               \
  {                                                                       \
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();                         \
    i2c_master_start(cmd);                                                \
    i2c_master_write_byte(cmd, (address << 1) | I2C_MASTER_WRITE, true);  \
    i2c_master_write_byte(cmd, reg, true);                                \
    i2c_master_start(cmd);                                                \
    i2c_master_write_byte(cmd, (address << 1) | I2C_MASTER_READ, true);   \
    if (data_size > 1)                                                    \
    {                                                                     \
      i2c_master_read(cmd, &data, data_size - 1, I2C_MASTER_ACK);         \
    }                                                                     \
    i2c_master_read_byte(cmd, &data + data_size - 1, I2C_MASTER_NACK);    \
    i2c_master_stop(cmd);                                                 \
    status = i2c_master_cmd_begin(I2C_NUM_0, cmd, DISPLAY_I2C_TIMEOUT);   \
    i2c_cmd_link_delete(cmd);                                             \
  }

StatusDisplay::StatusDisplay(openlcb::SimpleCanStack *stack, Service *service)
  : StateFlowBase(service)
{
#if !CONFIG_DISPLAY_TYPE_NONE
  clear();
  lccStatCollector_.emplace(stack);
  start_flow(STATE(init));
#endif
}

void StatusDisplay::clear()
{
  LOG(VERBOSE, "[StatusDisplay] clear screen");
  for(int line = 0; line < TEXT_ROW_COUNT; line++)
  {
    lines_[line] = "";
    lineChanged_[line] = true;
  }
}

void StatusDisplay::info(const std::string &format, ...)
{
#if !CONFIG_DISPLAY_TYPE_NONE
  char buf[256] = {0};
  va_list args;
  va_start(args, format);
  vsnprintf(buf, sizeof(buf), format.c_str(), args);
  va_end(args);
  lines_[0] = buf;
  lineChanged_[0] = true;
#endif
}

void StatusDisplay::status(const std::string &format, ...)
{
#if !CONFIG_DISPLAY_TYPE_NONE
  char buf[256] = {0};
  va_list args;
  va_start(args, format);
  vsnprintf(buf, sizeof(buf), format.c_str(), args);
  va_end(args);
  lines_[TEXT_ROW_COUNT - 1] = buf;
  lineChanged_[TEXT_ROW_COUNT - 1] = true;
#endif
}

void StatusDisplay::wifi(const std::string &format, ...)
{
#if !CONFIG_DISPLAY_TYPE_NONE
  char buf[256] = {0};
  va_list args;
  va_start(args, format);
  vsnprintf(buf, sizeof(buf), format.c_str(), args);
  va_end(args);
#if CONFIG_DISPLAY_OLED_LINE_COUNT >= 2 || CONFIG_DISPLAY_LCD_LINE_COUNT > 2
  lines_[1] = buf;
  lineChanged_[1] = true;
#else
  lines_[0] = buf;
  lineChanged_[0] = true;
#endif
#endif
}

void StatusDisplay::tcp_clients(const std::string &format, ...)
{
#if CONFIG_DISPLAY_OLED_LINE_COUNT > 2
  char buf[256] = {0};
  va_list args;
  va_start(args, format);
  vsnprintf(buf, sizeof(buf), format.c_str(), args);
  va_end(args);
  lines_[2] = buf;
  lineChanged_[2] = true;
#endif
}

void StatusDisplay::track_power(const std::string &format, ...)
{
#if CONFIG_DISPLAY_OLED_LINE_COUNT > 2 || CONFIG_DISPLAY_LCD_LINE_COUNT > 2
  char buf[256] = {0};
  va_list args;
  va_start(args, format);
  vsnprintf(buf, sizeof(buf), format.c_str(), args);
  va_end(args);
  lines_[3] = buf;
  lineChanged_[3] = true;
#endif
}

