axf33480/ESP32CommandStation/main/stateflows/StatusDisplay.cpp
StateFlowBase::Action StatusDisplay::init()
{
#if !CONFIG_DISPLAY_TYPE_NONE
  info("ESP32-CS: v%s", esp_ota_get_app_description()->version);
  LOG(INFO, "[StatusDisplay] Initializing I2C driver...");
  i2c_config_t i2c_config =
  {
    .mode = I2C_MODE_MASTER,
    .sda_io_num = (gpio_num_t)CONFIG_DISPLAY_SDA,
    .sda_pullup_en = GPIO_PULLUP_ENABLE,
    .scl_io_num = (gpio_num_t)CONFIG_DISPLAY_SCL,
    .scl_pullup_en = GPIO_PULLUP_ENABLE,
    .master =
    {
      .clk_speed = CONFIG_DISPLAY_I2C_BUS_SPEED
    }
  };
  ESP_ERROR_CHECK(i2c_param_config(I2C_NUM_0, &i2c_config));
  ESP_ERROR_CHECK(i2c_driver_install(I2C_NUM_0, I2C_MODE_MASTER, 0, 0, 0));

  // scan a handful of known I2C address ranges for LCD or OLED devices
  esp_err_t ret;
#if CONFIG_DISPLAY_TYPE_OLED
  for(uint8_t addr = 0x3C; addr <= 0x3C; addr++)
  {
    LOG(VERBOSE, "[StatusDisplay] Searching for OLED on address 0x%02x...", addr);
    I2C_READ_REG(addr, 0, regZero_, 1, ret);
    if (ret == ESP_OK)
    {
      i2cAddr_ = addr;
      return call_immediately(STATE(initOLED));
    }
  }
#elif CONFIG_DISPLAY_TYPE_LCD
  // PCF8574 or MCP23008
  for(uint8_t addr = 0x20; addr <= 0x27; addr++)
  {
    LOG(VERBOSE, "[StatusDisplay] Searching for LCD on address 0x%02x...", addr);
    I2C_READ_REG(addr, 0, regZero_, 1, ret);
    if (ret == ESP_OK)
    {
      i2cAddr_ = addr;
      return call_immediately(STATE(initLCD));
    }
  }
  // PCF8574A
  for(uint8_t addr = 0x38; addr <= 0x3F; addr++)
  {
    LOG(VERBOSE, "[StatusDisplay] Searching for LCD on address 0x%02x...", addr);
    I2C_READ_REG(addr, 0, regZero_, 1, ret);
    if (ret == ESP_OK)
    {
      i2cAddr_ = addr;
      return call_immediately(STATE(initLCD));
    }
  }
#endif
  LOG(WARNING, "[StatusDisplay] no display detected");

  // Scan the I2C bus and dump the output of devices that respond
  std::string scanresults =
    "     0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f\n"
    "00:         ";
  scanresults.reserve(256);
  for (uint8_t addr=3; addr < 0x78; addr++)
  {
    if (addr % 16 == 0)
    {
      scanresults += "\n" + int64_to_string_hex(addr) + ":";
    }
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_WRITE, true);
    i2c_master_stop(cmd);
    esp_err_t ret = i2c_master_cmd_begin(I2C_NUM_0, cmd, DISPLAY_I2C_TIMEOUT);
    i2c_cmd_link_delete(cmd);
    if (ret == ESP_OK)
    {
      scanresults += int64_to_string_hex(addr);
    }
    else if (ret == ESP_ERR_TIMEOUT)
    {
      scanresults += " ??";
    }
    else
    {
      scanresults += " --";
    }
  }
  LOG(INFO, "[StatusDisplay] %s", scanresults.c_str());
  LOG(WARNING, "[StatusDisplay] A supported display was not detected, below "
      "are the detected I2C devices\n%s", scanresults.c_str());
#endif // !CONFIG_DISPLAY_TYPE_NONE
  return exit();
}

StateFlowBase::Action StatusDisplay::initOLED()
{
#if CONFIG_DISPLAY_TYPE_OLED
  LOG(INFO, "[StatusDisplay] OLED display detected on address 0x%02x"
    , i2cAddr_);
#if CONFIG_DISPLAY_OLED_RESET_PIN != -1
  static bool resetCalled = false;
  if(!resetCalled)
  {
    LOG(INFO, "[StatusDisplay] Resetting OLED display");
    gpio_pad_select_gpio((gpio_num_t)CONFIG_DISPLAY_OLED_RESET_PIN);
    gpio_set_direction((gpio_num_t)CONFIG_DISPLAY_OLED_RESET_PIN
                      , GPIO_MODE_OUTPUT);
    gpio_set_level((gpio_num_t)CONFIG_DISPLAY_OLED_RESET_PIN, 0);
    resetCalled = true;
    return sleep_and_call(&timer_, MSEC_TO_NSEC(50), STATE(initOLED));
  }
  else
  {
    gpio_set_level((gpio_num_t)CONFIG_DISPLAY_OLED_RESET_PIN, 1);
  }
#endif // CONFIG_DISPLAY_OLED_RESET_PIN
  LOG(INFO, "[StatusDisplay] Display size: %dx%d (%d pages)"
    , CONFIG_DISPLAY_OLED_WIDTH, CONFIG_DISPLAY_OLED_HEIGHT, TEXT_ROW_COUNT);
  i2c_cmd_handle_t cmd = i2c_cmd_link_create();
  i2c_master_start(cmd);
	i2c_master_write_byte(cmd, (i2cAddr_ << 1) | I2C_MASTER_WRITE, true);
  i2c_master_write_byte(cmd, OLED_COMMAND_STREAM, true);
  i2c_master_write_byte(cmd, OLED_DISPLAY_OFF, true);
  i2c_master_write_byte(cmd, OLED_DISPLAY_MUX, true);
  i2c_master_write_byte(cmd, CONFIG_DISPLAY_OLED_WIDTH -1, true);
  i2c_master_write_byte(cmd, OLED_DISPLAY_OFFSET, true);
  i2c_master_write_byte(cmd, 0x00, true);
  i2c_master_write_byte(cmd, OLED_DISPLAY_START_LINE, true);
  i2c_master_write_byte(cmd, OLED_SET_CHARGEPUMP, true);
  i2c_master_write_byte(cmd, OLED_CHARGEPUMP_ON, true);

  // Test the register zero data with power/state masked to identify the
  // connected chipset since SSD1306 and SH1106 require slightly different
  // initialization parameters.
  if (((regZero_ & 0x0F) == 0x03) || ((regZero_ & 0x0F) == 0x06))
  {
    LOG(INFO, "[StatusDisplay] OLED Driver IC: SSD1306");
    i2c_master_write_byte(cmd, OLED_CLOCK_DIVIDER, true);
    i2c_master_write_byte(cmd, 0x80, true);
    i2c_master_write_byte(cmd, OLED_MEMORY_MODE, true);
    i2c_master_write_byte(cmd, OLED_MEMORY_MODE_PAGE, true);
    i2c_master_write_byte(cmd, OLED_SET_PRECHARGE, true);
    i2c_master_write_byte(cmd, 0xF1, true);
    i2c_master_write_byte(cmd, OLED_SET_VCOMH, true);
    i2c_master_write_byte(cmd, 0x40, true);
  }
  else if (((regZero_ & 0x0F) == 0x08))
  {
    LOG(INFO, "[StatusDisplay] OLED Driver IC: SH1106");
    sh1106_ = true;
    i2c_master_write_byte(cmd, OLED_CLOCK_DIVIDER, true);
    i2c_master_write_byte(cmd, 0xF0, true);
    i2c_master_write_byte(cmd, OLED_MEMORY_MODE, true);
    i2c_master_write_byte(cmd, OLED_MEMORY_MODE_HORIZONTAL, true);
    i2c_master_write_byte(cmd, OLED_SET_PRECHARGE, true);
    i2c_master_write_byte(cmd, 0x22, true);
    i2c_master_write_byte(cmd, OLED_SET_VCOMH, true);
    i2c_master_write_byte(cmd, 0x30, true);
  }
  else
  {
    LOG(WARNING, "[StatusDisplay] Unrecognized OLED Register zero value: %x"
      , regZero_);
    // cleanup and abort init process
    i2c_cmd_link_delete(cmd);
    return exit();
  }

#if CONFIG_DISPLAY_OLED_VFLIP
  i2c_master_write_byte(cmd, OLED_SET_SEGMENT_MAP_INVERTED, true);
  i2c_master_write_byte(cmd, OLED_SET_SCAN_MODE_INVERTED, true);
#else
  i2c_master_write_byte(cmd, OLED_SET_SEGMENT_MAP_NORMAL, true);
  i2c_master_write_byte(cmd, OLED_SET_SCAN_MODE_NORMAL, true);
#endif

  i2c_master_write_byte(cmd, OLED_COM_PIN_MAP, true);
#if CONFIG_DISPLAY_OLED_128x64
  i2c_master_write_byte(cmd, 0x12, true);
#elif CONFIG_DISPLAY_OLED_128x32 || CONFIG_DISPLAY_OLED_96x16
  i2c_master_write_byte(cmd, 0x02, true);
#endif

