axf33480/ESP32CommandStation/main/stateflows/StatusDisplay.cpp
  i2c_master_write_byte(cmd, OLED_SET_CONTRAST, true);
  i2c_master_write_byte(cmd, CONFIG_DISPLAY_OLED_CONTRAST, true);
  i2c_master_write_byte(cmd, OLED_DISPLAY_RAM, true);
  i2c_master_write_byte(cmd, OLED_DISPLAY_NORMAL, true);
  i2c_master_write_byte(cmd, OLED_DISABLE_SCROLL, true);
  i2c_master_write_byte(cmd, OLED_DISPLAY_ON, true);
	i2c_master_stop(cmd);

  LOG(INFO, "[StatusDisplay] Sending init parameters to OLED display");
  esp_err_t ret =
    ESP_ERROR_CHECK_WITHOUT_ABORT(i2c_master_cmd_begin(I2C_NUM_0, cmd
                                                     , DISPLAY_I2C_TIMEOUT));
  i2c_cmd_link_delete(cmd);
  if (ret != ESP_OK)
  {
    LOG_ERROR("[StatusDisplay] Failed to initialize the OLED display");
    return exit();
  }
  LOG(INFO, "[StatusDisplay] Initialized OLED");

  return call_immediately(STATE(update));
#else
  return exit();
#endif // CONFIG_DISPLAY_TYPE_OLED
}

StateFlowBase::Action StatusDisplay::initLCD()
{
#if CONFIG_DISPLAY_TYPE_LCD
  LOG(INFO,
      "[StatusDisplay] Detected LCD on address 0x%02x, initializing %dx%x "
      "display..."
    , i2cAddr_, CONFIG_DISPLAY_LCD_COLUMN_COUNT, CONFIG_DISPLAY_LCD_LINE_COUNT);

  // wake up the LCD and init to known state
  send_to_lcd(i2cAddr_, 0x00);
  vTaskDelay(pdMS_TO_TICKS(10));

  // send init data to reset to 8 bit mode
  send_to_lcd(i2cAddr_, (LCD_FUNCTION_SET | LCD_8BIT_MODE | CONFIG_DISPLAY_LCD_ENABLE_BITMASK));
  ets_delay_us(1);
  send_to_lcd(i2cAddr_, (LCD_FUNCTION_SET | LCD_8BIT_MODE));
  ets_delay_us(4537);
  send_to_lcd(i2cAddr_, (LCD_FUNCTION_SET | LCD_8BIT_MODE | CONFIG_DISPLAY_LCD_ENABLE_BITMASK));
  ets_delay_us(1);
  send_to_lcd(i2cAddr_, (LCD_FUNCTION_SET | LCD_8BIT_MODE));
  ets_delay_us(237);
  send_to_lcd(i2cAddr_, (LCD_FUNCTION_SET | LCD_8BIT_MODE | CONFIG_DISPLAY_LCD_ENABLE_BITMASK));
  ets_delay_us(1);
  send_to_lcd(i2cAddr_, (LCD_FUNCTION_SET | LCD_8BIT_MODE));
  ets_delay_us(237);

  // switch to four bit mode
  send_to_lcd(i2cAddr_, (LCD_FUNCTION_SET | CONFIG_DISPLAY_LCD_ENABLE_BITMASK));
  ets_delay_us(1);
  send_to_lcd(i2cAddr_, LCD_FUNCTION_SET);
  ets_delay_us(37);

  // send rest of init commands as 4 bit mode
  send_lcd_byte(i2cAddr_, LCD_FUNCTION_SET | LCD_TWO_LINE_MODE, false);
  send_lcd_byte(i2cAddr_, LCD_CMD_DISPLAY_CONTROL | LCD_DISPLAY_ON, false);
  send_lcd_byte(i2cAddr_, LCD_CMD_CLEAR_SCREEN, false);
  ets_delay_us(1600); // clear takes 1.5ms
  send_lcd_byte(i2cAddr_, LCD_CMD_ENTRY_MODE | LCD_ENTRY_LEFT_TO_RIGHT, false);
  send_lcd_byte(i2cAddr_, LCD_CMD_RETURN_HOME, false);
  ets_delay_us(1600); // home takes 1.5ms
  return call_immediately(STATE(update));
#else
  return exit();
#endif // CONFIG_DISPLAY_TYPE_LCD
}

StateFlowBase::Action StatusDisplay::update()
{
#if CONFIG_LOCONET
  static uint8_t rotatingLineCount = 7;
#else
  static uint8_t rotatingLineCount = 5;
#endif
  // switch to next status line detail set after 10 iterations
  if(++updateCount_ > 10)
  {
    updateCount_ = 0;
    ++rotatingIndex_ %= rotatingLineCount;
  }
  // update the status line details every other iteration
  if(updateCount_ % 2)
  {
    if(rotatingIndex_ == 0)
    {
      status("Free Heap:%d"
                , heap_caps_get_free_size(MALLOC_CAP_INTERNAL)
      );
    }
    else if (rotatingIndex_ == 1)
    {
      uint64_t seconds = USEC_TO_SEC(esp_timer_get_time());
      status("Uptime: %02d:%02d:%02d"
                , (uint32_t)(seconds / 3600), (uint32_t)(seconds % 3600) / 60
                , (uint32_t)(seconds % 60)
      );
    }
    else if (rotatingIndex_ == 2)
    {
      status("Active Locos:%3d"
                , Singleton<AllTrainNodes>::instance()->size()
      );
    }
    else if (rotatingIndex_ == 3)
    {
      status(trackSignal->get_status_screen_data());
    }
    else if (rotatingIndex_ == 4)
    {
      static uint8_t _lccStatusIndex = 0;
      ++_lccStatusIndex %= 5;
      if(_lccStatusIndex == 0)
      {
        status("LCC Nodes: %d"
                  , lccStatCollector_->getRemoteNodeCount()
        );
      }
      else if (_lccStatusIndex == 1)
      {
        status("LCC Lcl: %d", lccStatCollector_->getLocalNodeCount()
        );
      }
      else if (_lccStatusIndex == 2)
      {
        status("LCC dg_svc: %d", lccStatCollector_->getDatagramCount()
        );
      }
      else if (_lccStatusIndex == 3)
      {
        status("LCC Ex: %d", lccStatCollector_->getExecutorCount()
        );
      }
      else if (_lccStatusIndex == 4)
      {
        status("LCC Pool: %d/%d", lccStatCollector_->getPoolFreeCount()
                  , lccStatCollector_->getPoolSize()
        );
      }
#if CONFIG_LOCONET
    }
    else if (rotatingIndex_ == 5)
    {
      status("LN-RX: %d/%d", locoNet.getRxStats()->rxPackets
                , locoNet.getRxStats()->rxErrors
      );
    }
    else if (rotatingIndex_ == 6)
    {
      status("LN-TX: %d/%d/%d", locoNet.getTxStats()->txPackets
                , locoNet.getTxStats()->txErrors
                , locoNet.getTxStats()->collisions
      );
#endif
    }
  }

#if CONFIG_DISPLAY_TYPE_OLED
  for (uint8_t row = 0; row < TEXT_ROW_COUNT; row++)
  {
    // if the line has not changed skip it
    if (!lineChanged_[row])
    {
      continue;
    }
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (i2cAddr_ << 1) | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, OLED_COMMAND_STREAM, true);
    i2c_master_write_byte(cmd, OLED_SET_PAGE | row, true);
    if (sh1106_)
    {
      i2c_master_write_byte(cmd, 0x02, true);
      i2c_master_write_byte(cmd, 0x10, true);
    }
    else
    {
      i2c_master_write_byte(cmd, OLED_MEMORY_COLUMN_RANGE, true);
      i2c_master_write_byte(cmd, 0x00, true);
      i2c_master_write_byte(cmd, CONFIG_DISPLAY_OLED_WIDTH - 1, true);
    }
    i2c_master_stop(cmd);
    ESP_ERROR_CHECK_WITHOUT_ABORT(
      i2c_master_cmd_begin(I2C_NUM_0, cmd, DISPLAY_I2C_TIMEOUT));
    i2c_cmd_link_delete(cmd);

    cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (i2cAddr_ << 1) | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, OLED_DATA_STREAM, true);
    uint8_t col = 0;
    for (auto ch : lines_[row])
    {
      // Check that the character is a renderable character.
      if (ch <= 0x7f)
      {
        i2c_master_write(cmd, (uint8_t *)oled_font[(uint8_t)ch]
                        , OLED_FONT_WIDTH, true);
      }
      else
      {
        // since it is not a renderable character, send the 50% shaded block to
        // the display instead so the rendering stays consistent
        i2c_master_write(cmd, (uint8_t *)oled_font[1], OLED_FONT_WIDTH, true);
      }
      col++;
      // make sure we haven't rendered past the end of the display
      if (col >= TEXT_COLUMN_COUNT)
      {
        break;
      }
    }
    while(col++ < TEXT_COLUMN_COUNT)
    {
      i2c_master_write(cmd, (uint8_t *)oled_font[0], OLED_FONT_WIDTH, true);
    }
    i2c_master_stop(cmd);
    ESP_ERROR_CHECK_WITHOUT_ABORT(
      i2c_master_cmd_begin(I2C_NUM_0, cmd, DISPLAY_I2C_TIMEOUT));
    i2c_cmd_link_delete(cmd);
    lineChanged_[row] = false;
  }
#elif CONFIG_DISPLAY_TYPE_LCD
  for (int row = 0; row < TEXT_ROW_COUNT; row++)
  {
    if (!lineChanged_[row])
    {
      continue;
    }
    const int row_offsets[] = { 0x00, 0x40, 0x14, 0x54 };
    send_lcd_byte(i2cAddr_, LCD_ADDRESS_SET | row_offsets[row], false);
    uint8_t col = 0;
    for (auto ch : lines_[row])
    {
      send_lcd_byte(i2cAddr_, ch, true);
      col++;
      if (col >= TEXT_COLUMN_COUNT)
      {
        break;
      }
    }
    // space pad to the width of the LCD
    while(col++ < TEXT_COLUMN_COUNT)
    {
      send_lcd_byte(i2cAddr_, ' ', true);
    }
    lineChanged_[row] = false;
  }
#endif
  return sleep_and_call(&timer_, MSEC_TO_NSEC(450), STATE(update));
}